// Task 01 [Get in order]
// По порядку становись
//
// Даны три переменные целочисленного типа: a, b и c. Необходимо разработать эффективный
// алгоритм и реализовать функцию, которая упорядочивает значения данных переменных в порядке
// невозрастания, т.е. функция должна сделать так, чтобы содержимое оригинальных переменных
// удовлетворяло следующему неравенству a >= b >= c.
// 
// На базе данной функции необходимо реализовать тестовый или полноценный проект.
#include "logic.h"

void swap_if(int* a, int* b) {
	if (*a < *b) {
		int t = *a;
		*a = *b;
		*b = t;
	}
}

void get_in_order(int* a, int* b, int* c) {
	swap_if(a, b);
	swap_if(a, c);
	swap_if(b, c);
}
